## Chapter 8 Homework

### Question 1

##### How do you import the pandas library in Python?

In [6]:
# You import the pandas library by using the import statement.
import pandas as pd # pandas is abbreviated as pd so it is easier later in the code to type pd instead of pandas.

### Question 2

##### How do you read a CSV file named data.csv into a pandas DataFrame?

In [16]:
# You read a CSV file using the read_csv function in pandas.
# Since the function is a pandas function, you have to reference pandas first (use pd).
# EXAMPLE:
df = pd.read_csv('data.csv') # This reads the file.csv file and stores it in the variable df (df for DataFrame).

### Question 3

##### How do you display the first 5 rows of a DataFrame named df?

In [17]:
# You can display the first 5 rows of df by using the head function
df.head() # This will display the first 5 rows of the data in the df DataFrame.

,Name,DOB,Age,Vocation,Smoke,HR,sBP,CholesterolBefore,TAG,Survey,CholesterolAfter,Delta,Group
0,Dylan Patton,1981-10-07,43,Energy manager,0,47,145,1.2,1.2,1,0.7,0.5,Active
1,Sandra Howard,1993-01-27,53,Tax adviser,0,51,115,1.2,0.6,3,1.0,0.2,Active
2,Samantha Williams,1973-12-21,33,IT consultant,0,54,120,2.0,1.3,3,1.7,0.3,Active
3,Ashley Hensley,1981-12-01,43,"Nurse, children's",0,54,103,2.1,1.6,4,2.1,0.0,Active
4,Robert Wilson,1964-06-23,46,Clinical embryologist,0,61,138,2.8,2.1,5,2.8,0.0,Active

### Question 4

##### How do you find the number of rows and columns in a DataFrame df?

In [18]:
# You can find the number of rows and columns in the DataFrame by using the shape attribute.
# It will give the number of rows first and then the number of columns.
df.shape

(200, 13)

### Question 5

##### How do you print the names of all the columns in a DataFrame df?

In [19]:
# You can print all of the names of the columns by by using the columns attribute.
df.columns

Index(['Name', 'DOB', 'Age', 'Vocation', 'Smoke', 'HR', 'sBP',
       'CholesterolBefore', 'TAG', 'Survey', 'CholesterolAfter', 'Delta',
       'Group'],
      dtype='object')

### Question 6

##### How do you get the summary information of the DataFrame df including data types and non-null values?

In [20]:
# You can print the data types of each column by using the dtypes attribute.
df.dtypes

Name                  object
DOB                   object
Age                    int64
Vocation              object
Smoke                  int64
HR                     int64
sBP                    int64
CholesterolBefore    float64
TAG                  float64
Survey                 int64
CholesterolAfter     float64
Delta                float64
Group                 object
dtype: object

### Question 7

##### How do you select only the rows in DataFrame df where the column A is greater than 5?

In [54]:
# Select only rows in the DataFrame df where column A is greater than 5.
[df.loc[df.Age > 5]]

[            DOB  Age                        Vocation  Smoke   HR  sBP  \
 0    1981-10-07   43                  Energy manager      0   47  145
 1    1993-01-27   53                     Tax adviser      0   51  115
 2    1973-12-21   33                   IT consultant      0   54  120
 3    1981-12-01   43               Nurse, children's      0   54  103
 4    1964-06-23   46           Clinical embryologist      0   61  138
 ..          ...  ...                             ...    ...  ...  ...
 195  1936-11-25   66          Sales professional, IT      1   96  201
 196  1986-07-01   54                       Paramedic      1   93  183
 197  1959-01-30   61  Chartered certified accountant      0   99  212
 198  1979-05-30   65                          Dancer      1   98  200
 199  1972-07-27   66              Theme park manager      1  102  208

      CholesterolBefore  TAG  Survey  CholesterolAfter  Delta    Group
 0                  1.2  1.2       1               0.7    0.5   Active
 1                  1.2  0.6       3               1.0    0.2   Active
 2                  2.0  1.3       3               1.7    0.3   Active
 3                  2.1  1.6       4               2.1    0.0   Active
 4                  2.8  2.1       5               2.8    0.0   Active
 ..                 ...  ...     ...               ...    ...      ...
 195               10.1  5.1       5              10.0    0.1  Control
 196               10.1  5.3       5              10.0    0.1  Control
 197               10.1  5.6       4               9.7    0.4  Control
 198               10.1  5.3       3              10.0    0.1  Control
 199               11.1  5.7       2              10.7    0.4   Active

 [200 rows x 12 columns]]

### Question 8

##### How do you select the columns A and B from the DataFrame df?

In [25]:
# You can select columns A and B from the DataFrame df using the loc function.
# The loc function is used to select rows and columns by label.
# The first parameter is the rows you want to select and the second parameter is the columns you want to select.
df.loc[:, ['Name', 'Age']]

                  Name  Age
0         Dylan Patton   43
1        Sandra Howard   53
2    Samantha Williams   33
3       Ashley Hensley   43
4        Robert Wilson   46
..                 ...  ...
195        John Curtis   66
196     Jessica Tanner   54
197      Charles Smith   61
198       Barry Porter   65
199      Julie Barrett   66

[200 rows x 2 columns]

### Question 9

##### How do you rename the column A to Alpha in DataFrame df?

In [31]:
# You can rename column A to Alpha using the rename function.
# The first parameter is the old name and the second parameter is the new name.
df.rename(columns={'Name': 'Alpha'}, inplace=True)
df.columns

Index(['Alpha', 'DOB', 'Age', 'Vocation', 'Smoke', 'HR', 'sBP',
       'CholesterolBefore', 'TAG', 'Survey', 'CholesterolAfter', 'Delta',
       'Group'],
      dtype='object')

### Question 10

##### How do you replace all occurrences of the value 999 in DataFrame df with nan?

In [32]:
# You cqn replace all occurrences of the value 999 with nan in the DataFrame df using the replace function.
# The first parameter is the value you want to replace and the second parameter is the value you want to replace it with.
df.replace(999, 'nan', inplace=True)

### Question 11

##### How do you drop all rows in DataFrame df that contain missing values?

In [33]:
# You can drop all rows in a DataFrame df that contain missing values using the drop function.
# The axis parameter is set to 0 to indicate that you want to drop rows.
df.drop(columns='Alpha', inplace=True)

### Question 12

##### How do you fill all missing values in DataFrame df with 0?

In [34]:
# You can fill all the missing values in DataFrame df with the value 0 using the fillna function.
df.fillna(0, inplace=True)

### Question 13

##### How do you calculate the mean of column A in DataFrame df?

In [44]:
# You can calculate the mean of column A in DataFrame df using the mean function.
age_column = df['Age']
Age = age_column.to_numpy()
age_column.mean()

53.07

### Question 14

##### How do you create a new column C in DataFrame df that is the sum of columns A and B?

In [53]:
# You can create a new column C in DataFrame df that is the sum of columns A and B using filtering
# The first parameter is the name of the new column and the second parameter is the operation you want to perform.
df_Sum = df.loc[df.Age] + df.loc[df.Age]

### Question 15

##### How do you save the DataFrame df to a CSV file named output.csv? (Hint: Find the solution by searching the pandas documentation)

In [52]:
# You can save the DataFrame df to a new CSV file named output.csv using the to_csv function.
# The first parameter is the name of the new file and the second parameter is the delimiter you want to use.
df.to_csv('output.csv', sep=',', index=False)